[
    {
        "title": "Shubman Gill hospitalised in Chennai after drop in platelet count, remains doubtful for Pakistan game",
        "content": "Synopsis Indian cricketer Shubman Gill has been hospitalized in Chennai due to dengue, with his platelet count dropping below 100,000. This puts his participation in the World Cup match against Pakistan in doubt. Gill, who tested positive for dengue upon arriving in Chennai, will also miss India's second game against Afghanistan. He is currently receiving treatment at a multi-care specialty hospital in Chennai, with the team's doctor monitoring his progress. Gill's health is a priority for the team management, as it takes time to recover from dengue and be fit for a tournament like the World Cup. AFP India opener Shubman Gill , who is currently down with dengue, has been hospitalised in Chennai after his platelet count dropped below 100,000 and remains a doubtful starter for the marquee World Cup clash against Pakistan in Ahmedabad on October 14. Gill , who tested positive for dengue upon his arrival in Chennai last week has been down for the past week and will also miss India's second game against Afghanistan on Wednesday. \"Shubman Gill was on drip at the Chennai team hotel for the last couple of days. However his platelet count dropped to 70,000 and as it is a case with dengue patients, once the count is below 100,000, you are admitted to a medical facility as a precautionary measure. Once the count again goes above 100,000, he would be discharged,\" a BCCI source told PTI on conditions of anonymity. It is learnt that Gill has been admitted to a Chennai's well-known multi-care speciality hospital 'Kauvery' and the Indian team's doctor Rizwan has stayed back to monitor his progress. While there is still 96 hours left for the match against Pakistan, it will be Gill's health which will be paramount for the Indian team management as he requires to be 100 per cent fit for the marathon tournament. A bout of dengue weakens the body considerably but even for an elite athlete, it does take time to bear the physical bump and grind of a tournament like the World Cup. In fact skipper Rohit Sharma had said first priority for him is to see that Gill is no longer sick. \"I mean obviously, he is sick. I feel for him. But in terms of, you know, me being the human being first, I want him to get well, not the captain thinking, oh, I want Gill to play tomorrow. No, I want him to get well he you know he's a young guy he's got fit body so he'll recover he'll recover quick,\" Rohit has said before the game against Australia. Print Edition Tuesday, 10 Oct, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics ET Markets Smart Investing Learn more about our print edition More Bear Attack: Israel-Hamas Conflict Spills onto Street Indian equities weakened on Monday as heightened uncertainty over the Israel-Hamas conflict led to a flight of money, across global markets, to safe-haven assets such as gold and the US dollar. 107 Medals- India Inc Cheers the Best RoI of All A part of the credit for India’s record-breaking achievement of 107 medals at the Asian Games goes to India Inc. Read More News on gill world cup chennai Pakistan game India opener Shubman Gill platelet count rohit sharma rizwan rohit (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Disputes Byju Raveendran vs lenders: What US court documents reveal about the edtech cat and mouse 16 mins read Investing What makes TVS a clear outperformer? It’s not a Hero Splendor or a Honda Activa-like product. 7 mins read People Nassim Nicholas Taleb, the man who foresaw the 2008 crash, has another prophecy on the cards 11 mins read Subscribe to ETPrime",
        "link": "https://economictimes.indiatimes.com/news/sports/shubman-gill-hospitalised-in-chennai-after-drop-in-platelet-count-remains-doubtful-for-pakistan-game/articleshow/104302047.cms",
        "publishedAt": "2023-10-10",
        "author": "Unknown Author"
    },
    {
        "title": "Shubman Gill Hospitalised In Chennai After Sudden Drop In Platelet Count, Likely To Miss ODI World Cup Clash Vs Pakistan",
        "content": "As per reports, Gill's platelet count has been low for a few days. Read on to know why platelet count suddenly drops when dengue virus enters your body, and what it takes for the patient to fight the infection. Shubman Gill, the star opener for India, has been hospitalized in Chennai due to dengue and will not travel to Delhi to take part in India's second World Cup match against Afghanistan. According to sources, Gill's platelet count has been low for a while, which is why it has been suggested that he refrain from taking a trip. Gill, who missed India's opening match against Australia due to dengue fever, is now anticipated to play a direct role in India's third game. Dr. Rizwan Khan, a BCCI physician who is traveling with the team, is treating the opener who was admitted to Chennai's Kaveri Hospital. \"Team India batter Shubman Gill will not be travelling with the team to Delhi on 9th October 2023. The opening batter who missed the team's first fixture in the ICC Men's Cricket World Cup 2023 against Australia in Chennai is set to miss the team's next fixture against Afghanistan in Delhi on the 11th of October. He will stay back in Chennai and will be under the supervision of the medical team,\" read BCCI's statement.",
        "link": "https://www.thehealthsite.com/news/shubman-gill-hospitalised-in-chennai-after-sudden-drop-in-platelet-count-likely-to-miss-odi-world-cup-clash-vs-pakistan-1018646/",
        "publishedAt": "2023-10-10",
        "author": "Satata Karmakar"
    },
    {
        "title": "Pakistan dispatches relief goods to earthquake-hit Afghanistan",
        "content": "KARACHI - Pakistan on Monday said it is dispatching the first consignment of relief goods for the victims of Saturday’s massive earthquakes in northwestern Afghanistan. Caretaker Prime Minister Anwaarul Haq Kakar said that Islamabad is immediately sending a medical team, field hospital, 50 tents, and 500 blankets to the earthquake-hit region on the “specific request” of the interim Afghan government. “On my instructions – in addition to the relief goods – all the requested items are being dispatched in the afternoon today (Monday), with more relief goods to follow,” Kakar said in a post on X. “Deeply saddened by the devastating earthquake in Herat, Afghanistan. Our hearts go out to the affected communities,” he further said, adding that Islamabad stands “in solidarity with the Afghans during this difficult time.” Kakar said he instructed the Pakistani disaster authority to send “maximum” support to the affected people. The death toll from Saturday’s massive earthquakes in Afghanistan has shot up to over 2,500, said Taliban police.",
        "link": "https://www.nation.com.pk/10-Oct-2023/pakistan-dispatches-relief-goods-to-earthquake-hit-afghanistan",
        "publishedAt": "2023-10-10",
        "author": "Agencies"
    }
]